todos/backend/app/controllers/api/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    @todo = Todo.new(todo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdfhsdfhsdf"], ["body", "sdfhsdfhsdfh"], ["created_at", "2020-12-01 00:59:25.941028"], ["updated_at", "2020-12-01 00:59:25.941028"]]